#Область СлужебныеПроцедурыИФункции
	
Процедура ЗаполнитьТабличнуюЧастьКонтактнаяИнформация() Экспорт
	
	Выборка = Справочники.Контрагенты.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекКонтрагент = Выборка.Ссылка.ПолучитьОбъект();
		ТекКонтрагент.КонтактнаяИнформация.Очистить();
		Если ЗначениеЗаполнено(ТекКонтрагент.УдалитьEMail) Тогда
			Стр = ТекКонтрагент.КонтактнаяИнформация.Добавить();
			Стр.Вид = Справочники.ВидыКонтактнойИнформации.EMailКонтрагента;
			Стр.Значение = ТекКонтрагент.УдалитьEMail;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекКонтрагент.УдалитьТелефон) Тогда
			Стр = ТекКонтрагент.КонтактнаяИнформация.Добавить();
			Стр.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
			Стр.Значение = ТекКонтрагент.УдалитьТелефон;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекКонтрагент.УдалитьФактическийАдрес) Тогда
			Стр = ТекКонтрагент.КонтактнаяИнформация.Добавить();
			Стр.Вид = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
			Стр.Значение = ТекКонтрагент.УдалитьФактическийАдрес;
		КонецЕсли;
		
		 Если ЗначениеЗаполнено(ТекКонтрагент.УдалитьЮридичесикйАдрес) Тогда
			Стр = ТекКонтрагент.КонтактнаяИнформация.Добавить();
			Стр.Вид = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
			Стр.Значение = ТекКонтрагент.УдалитьЮридичесикйАдрес;
		КонецЕсли;
		
		ТекКонтрагент.Записать();
	КонецЦикла;
	
КонецПроцедуры
 
 #КонецОбласти