#Область СлужебныеПроцедурыИФункции
	
Процедура ПриНачалеРаботыСистемы() Экспорт
	
	НоваяВерсия = Метаданные.Версия;
	СтараяВерсия = Константы.ВерсияКонфигурации.Получить();
	
	Если НоваяВерсия <> СтараяВерсия Тогда
		ПриИзмененииВерсии(СтараяВерсия, НоваяВерсия);
		Константы.ВерсияКонфигурации.Установить(Метаданные.Версия);
	КонецЕсли;

КонецПроцедуры

Процедура ПриИзмененииВерсии(СтараяВерсия, НоваяВерсия)

	Если НоваяВерсия = "1.0.0.1" Или НоваяВерсия > "1.0.0.1"
		//("1.0.0.1" = СтараяВерсия Или "1.0.0.1" > СтараяВерсия) И ("1.0.0.1" = НоваяВерсия Или "1.0.0.1" < НоваяВерсия)
		Тогда
		Справочники.ВидыКонтактнойИнформации.ЗаполнитьПредопределенныеЭлементы();
	КонецЕсли;
	
	Если НоваяВерсия = "1.0.0.2" Или НоваяВерсия > "1.0.0.2" Тогда
		Справочники.Контрагенты.ЗаполнитьТабличнуюЧастьКонтактнаяИнформация();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
