#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	Телефон = ТелефонКонтрагента.ПолучитьОбъект();
	Телефон.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Телефон.Записать();
	
	EMail = EMailКонтрагента.ПолучитьОбъект();
	EMail.Тип = Перечисления.ТипыКонтактнойИнформации.EMail;
	EMail.Записать();
	
	АдресФактический = ФактическийАдресКонтрагента.ПолучитьОбъект();
	АдресФактический.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	АдресФактический.Записать();
	 
	АдресЮридический = ЮридическийАдресКонтрагента.ПолучитьОбъект();
	АдресЮридический.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	АдресЮридический.Записать();
	
	АдресПочтовый = ПочтовыйАдресКонтрагента.ПолучитьОбъект();
	АдресПочтовый.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	АдресПочтовый.Записать();

КонецПроцедуры

#КонецОбласти