
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПользовательИБ =  ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ) Или ПользовательИБ = Неопределено Тогда
		ВходРазрешен = Ложь;
	Иначе
		ВходРазрешен = ПользовательИБ.АутентификацияСтандартная;
		ИмяДляВхода = ПользовательИБ.Имя;
		Пароль = "";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ПользовательИБ =  ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	Если ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ) Тогда
		ПользовательИБ.Имя = ИмяДляВхода;
		ПользовательИБ.АутентификацияСтандартная = ВходРазрешен;
		ПользовательИБ.Пароль = "";
		ПользовательИБ.Записать();
	ИначеЕсли ВходРазрешен = Истина И Не ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ) Тогда
		ПользовательИнформационнойБазы = ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательИнформационнойБазы.Имя = ТекущийОбъект.Наименование;
		ПользовательИнформационнойБазы.ПолноеИмя = ТекущийОбъект.Наименование;
		ПользовательИнформационнойБазы.АутентификацияСтандартная = Истина;
		ПользовательИнформационнойБазы.Роли.Добавить(Метаданные.Роли.БазовыеПрава);
		ПользовательИнформационнойБазы.Записать();
		
		ТекущийОбъект.ИдентификаторПользователяИБ = ПользовательИнформационнойБазы.УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СлучайныйПароль(Команда)
	#Если Не ВебКлиент Тогда
		
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	СтрокаСлучайныйПароль = "";
	Пока СтрДлина(СтрокаСлучайныйПароль) < 6 Цикл
		КодСимволаПароля = ГСЧ.СлучайноеЧисло(48, 122);
		Если (КодСимволаПароля < 65 И КодСимволаПароля > 57)
			Или (КодСимволаПароля < 97 И КодСимволаПароля > 90)
			Или КодСимволаПароля > 122 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаСлучайныйПароль = СтрокаСлучайныйПароль + Символ(КодСимволаПароля);
	КонецЦикла;
	Элементы.Пароль.РежимПароля = Ложь;
	Пароль = СтрокаСлучайныйПароль;
	
	#Иначе 
		ВызватьИсключение "Недоступно в веб-клиенте!";
	#КонецЕсли
КонецПроцедуры

#КонецОбласти