
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок1

&НаКлиенте
Процедура Список1ПриАктивизацииСтроки(Элемент)
	
	СписокОтбора = Список;
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
	ПравоеЗначение = Элемент.ТекущаяСтрока;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОтбора, ЛевоеЗначение, ПравоеЗначение, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	СписокОтбора = Цены;
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
	ПравоеЗначение = Элемент.ТекущаяСтрока;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОтбора, ЛевоеЗначение, ПравоеЗначение, Истина);
	
КонецПроцедуры

#КонецОбласти