
//Процедура ПередЗаписью(Отказ)
//	Если ПользователиИнформационнойБазы.НайтиПоИмени(Наименование) = Неопределено Тогда
//		ПользовательИнформационнойБазы = ПользователиИнформационнойБазы.СоздатьПользователя();
//		ПользовательИнформационнойБазы.Имя = Наименование;
//		ПользовательИнформационнойБазы.ПолноеИмя = Наименование;
//		ПользовательИнформационнойБазы.АутентификацияСтандартная = Истина;
//		ПользовательИнформационнойБазы.Записать();
//		ИдентификаторПользователяИБ = ПользовательИнформационнойБазы.УникальныйИдентификатор;
//	Иначе
//		ИдентификаторПользователяИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование).УникальныйИдентификатор;
//	КонецЕсли;
//КонецПроцедуры
