& НаКлиенте
Процедура ПриИзмененииНоменклатурыНоменклатурнойГруппы(ИзмененнаяСтрока)
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа) Тогда
		ЗаписьДокумента();
		ИзмененнаяСтрока.Скидка = ЦеныВызовСервера.СкидкаНаДату(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа, Объект.Дата);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураНоменклатурнаяГруппаПриИзменении(Элемент)
	ПриИзмененииНоменклатурыНоменклатурнойГруппы(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаСервере
Процедура ЗаписьДокумента()
	ЭтотОбъект.Записать();
КонецПроцедуры