#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	Отбор = Новый Структура;
	Отбор.Вставить("Уволен", Ложь);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Справочник.Сотрудники.ФормаСписка",
				ПараметрыФормы,
				ПараметрыВыполненияКоманды.Источник,
				"Не уволен",
				ПараметрыВыполненияКоманды.Окно,
				ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти