#Область ОбработчикиСобытийФормы
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокОтбора = Список;
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ПравоеЗначение = Ложь;
	Использование = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОтбора, ЛевоеЗначение, ПравоеЗначение, Использование);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
 
&НаКлиенте
Процедура ПоказыватьПомеченныхНаУдалениеПриИзменении(Элемент)
	ДоступоностьПомеченныхНаУдаление();
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы
 
&НаКлиенте
Процедура ПоказыватьПомеченныхНаУдаление(Команда)
	ПоказыватьПомеченныхНаУдаление = Не ПоказыватьПомеченныхНаУдаление;
	ДоступоностьПомеченныхНаУдаление();
КонецПроцедуры

#КонецОбласти
 
#Область  СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДоступоностьПомеченныхНаУдаление()
	
	Элементы.ФормаПоказыватьПомеченныхНаУдаление.Пометка = ПоказыватьПомеченныхНаУдаление;
	СписокОтбора = Список;
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ПравоеЗначение = Ложь;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОтбора, ЛевоеЗначение, ПравоеЗначение, Не ПоказыватьПомеченныхНаУдаление);
	
КонецПроцедуры

#КонецОбласти


 